In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv("SALARY.csv")
df.head()

,age,statut,chiffre,etudes,nombre_annee_etudes,situation_familiale_un,secteur_activite,situation_familiale_deux,ethnie,genre,plus_values,moins_value,nombre_heure_semaine,pays_naissance,S
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [2]:
df = df.drop('chiffre', axis=1)

In [3]:
df.head()

,age,statut,etudes,nombre_annee_etudes,situation_familiale_un,secteur_activite,situation_familiale_deux,ethnie,genre,plus_values,moins_value,nombre_heure_semaine,pays_naissance,S
0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
from sklearn.preprocessing import LabelEncoder

# transformation des variables qualitatives avec Label Encoder
df.iloc[:] = df.iloc[:].apply(LabelEncoder().fit_transform)
df

,age,statut,etudes,nombre_annee_etudes,situation_familiale_un,secteur_activite,situation_familiale_deux,ethnie,genre,plus_values,moins_value,nombre_heure_semaine,pays_naissance,S
0,22,7,9,12,4,1,1,4,1,25,0,39,39,0
1,33,6,9,12,2,4,0,4,1,0,0,12,39,0
2,21,4,11,8,0,6,1,4,1,0,0,39,39,0
3,36,4,1,6,2,6,0,2,1,0,0,39,39,0
4,11,4,9,12,2,10,5,2,0,0,0,39,5,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,10,4,7,11,2,13,5,4,0,0,0,37,39,0
32557,23,4,11,8,2,7,0,4,1,0,0,39,39,1
32558,41,4,11,8,6,1,4,4,0,0,0,39,39,0
32559,5,4,11,8,4,1,3,4,1,0,0,19,39,0
32560,35,5,11,8,2,4,5,4,0,108,0,39,39,1